npm.org
#+TITLE: NPM Loom: DotCortex
#+DESCRIPTION: Node npm manifest
#+AUTHOR: Mètsàtron
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* NPM manifest
Columns: PKG VERSION FLAGS GLOBAL SOURCE REGISTRY TARBALL EXTRA
Leave VERSION empty to treat the currently installed version as canonical.

#+BEGIN_SRC text :tangle all/.npm/manifest/global.ssv
# ~/DotCortex/all/.npm/manifest/global.ssv
# PKG VERSION FLAGS GLOBAL SOURCE REGISTRY TARBALL EXTRA

# Captured from T480s 2026-03-15
@anthropic-ai/claude-code "" "" "global" "registry" "" "" ""
@github/copilot "" "" "global" "registry" "" "" ""
@google/gemini-cli "" "" "global" "registry" "" "" ""
@openai/codex "" "" "global" "registry" "" "" ""
@mariozechner/pi-coding-agent "" "" "global" "registry" "" "" ""
@siteboon/claude-code-ui "" "" "global" "registry" "" "" "cloudcli-setup"
opencode-ai "" "" "global" "registry" "" "" ""
@grinev/opencode-telegram-bot "" "" "global" "registry" "" "" ""
task-master-ai "" "" "global" "registry" "" "" ""
@emacs-eask/cli "" "" "global" "registry" "" "" ""
firecrawl-cli "" "" "global" "registry" "" "" ""
defuddle "" "" "global" "registry" "" "" ""
antigravity-usage "" "" "global" "registry" "" "" ""
antigravity-kit "" "" "global" "registry" "" "" ""
skills "" "" "global" "registry" "" "" ""
#+END_SRC

* Isolated Node env for DotCortex
#+BEGIN_SRC bash :tangle all/.local/bin/dotcortex-node-env :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/dotcortex-node-env
#!/usr/bin/env bash
set -euo pipefail

export NPM_CONFIG_PREFIX="${NPM_CONFIG_PREFIX:-$HOME/.npm-global}"
export PATH="$HOME/.local/bin:$HOME/.cargo/bin:/usr/local/bin:/usr/local/sbin:$PATH"

if [ -d "$HOME/.config/guix/current/bin" ]; then
  export PATH="$HOME/.config/guix/current/bin:$PATH"
fi

# Prefer DotCortex-managed Guix Node/NPM over the host system toolchain.
if [ -d "$HOME/.guix-extra-profiles/core/core/bin" ]; then
  export PATH="$HOME/.guix-extra-profiles/core/core/bin:$PATH"
fi

if [ -d "$HOME/.guix-extra-profiles/core/core/lib/locale" ]; then
  export GUIX_LOCPATH="${GUIX_LOCPATH:-$HOME/.guix-extra-profiles/core/core/lib/locale}"
fi

# Ensure the prefix directories exist for npm
if [ ! -d "$NPM_CONFIG_PREFIX/lib/node_modules" ]; then
  mkdir -p "$NPM_CONFIG_PREFIX/lib/node_modules"
fi

if [ ! -d "$NPM_CONFIG_PREFIX/bin" ]; then
  mkdir -p "$NPM_CONFIG_PREFIX/bin"
fi

export PATH="$NPM_CONFIG_PREFIX/bin:$PATH"

unset LD_LIBRARY_PATH 2>/dev/null || true

exec "$@"
#+END_SRC

* Package-specific npm post-apply hooks
#+BEGIN_SRC bash :tangle all/.local/bin/npm-postapply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/npm-postapply
set -euo pipefail

pkg="${1:?package name required}"
extra="${2:-}"
RUN="${DOTCORTEX_NODE_ENV:-$HOME/DotCortex/all/.local/bin/dotcortex-node-env}"

export NPM_CONFIG_PREFIX="${NPM_CONFIG_PREFIX:-$HOME/.npm-global}"

pkg_dir="$NPM_CONFIG_PREFIX/lib/node_modules/$pkg"

write_cloudcli_env() {
  mkdir -p "$pkg_dir"
  cat >"$pkg_dir/.env" <<EOF
# Managed by DotCortex via npm.org
SERVER_PORT=3001
HOST=0.0.0.0
VITE_PORT=5173
DATABASE_PATH=$HOME/.cloudcli/auth.db
CLAUDE_CLI_PATH=claude
CONTEXT_WINDOW=160000
WORKSPACES_ROOT=$HOME
EOF
}

cloudcli_binary_healthy() {
  [ -d "$pkg_dir" ] || return 1

  "$RUN" node - "$pkg_dir" <<'EOF'
const path = require('path');

const pkgDir = process.argv[2];

try {
  require(path.join(pkgDir, 'node_modules', 'better-sqlite3'));
  process.exit(0);
} catch (error) {
  process.stderr.write(String(error && error.message ? error.message : error) + '\n');
  process.exit(1);
}
EOF
}

ensure_cloudcli_setup() {
  [ -d "$pkg_dir" ] || return 0

  write_cloudcli_env

  if ! cloudcli_binary_healthy; then
    echo "== npm postapply: rebuilding native modules for $pkg =="
    "$RUN" npm rebuild -g "$pkg" better-sqlite3

    if ! cloudcli_binary_healthy; then
      echo "CloudCLI native module check still failed after rebuild" >&2
      return 1
    fi
  fi
}

case "$extra" in
  cloudcli-setup)
    ensure_cloudcli_setup
    ;;
esac
#+END_SRC

* Capture current global npm → manifest
# Append any new global npm packages into DotCortex manifest, do not clobber.
#+BEGIN_SRC bash :tangle all/.local/bin/npm-capture :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/npm-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.npm/manifest/global.ssv"
RUN="$HOME/DotCortex/all/.local/bin/dotcortex-node-env"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

# Existing packages already tracked in manifest
awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | LC_ALL=C sort -u >"$tmp_existing"

# Current global packages (names only) from npm list -g --depth=0 --json
"$RUN" npm list -g --depth=0 --json 2>/dev/null \
  | node -e '
      let raw = "";
      process.stdin.setEncoding("utf8");
      process.stdin.on("data", (chunk) => (raw += chunk));
      process.stdin.on("end", () => {
        const deps = JSON.parse(raw || "{}").dependencies || {};
        for (const name of Object.keys(deps)) {
          console.log(name);
        }
      });
    ' | LC_ALL=C sort -u >"$tmp_have"

# new = have - existing
comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new npm globals to capture into $MAN"
  exit 0
fi

while read -r pkg; do
  [ -n "$pkg" ] || continue
  [ "$pkg" = "npm" ] && continue
  # PKG VERSION FLAGS GLOBAL SOURCE REGISTRY TARBALL EXTRA
  printf '%s "" "" "global" "registry" "" "" ""\n' "$pkg" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"

echo "Updated $MAN"
#+END_SRC

* Plan diff
#+BEGIN_SRC bash :tangle all/.local/bin/npm-diff :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/npm-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.npm/manifest/global.ssv"
RUN="$HOME/DotCortex/all/.local/bin/dotcortex-node-env"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"
tmp_outdated="$(mktemp)"

# Desired packages from manifest
awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | LC_ALL=C sort -u >"$tmp_want"

# Live global packages from npm
"$RUN" npm list -g --depth=0 --json 2>/dev/null \
  | node -e '
      let raw = "";
      process.stdin.setEncoding("utf8");
      process.stdin.on("data", (chunk) => (raw += chunk));
      process.stdin.on("end", () => {
        const deps = JSON.parse(raw || "{}").dependencies || {};
        for (const name of Object.keys(deps)) {
          console.log(name);
        }
      });
    ' | LC_ALL=C sort -u >"$tmp_have"

# Live outdated packages from npm. npm exits non-zero when updates exist.
{
  "$RUN" npm outdated -g --json 2>/dev/null || true
} | node -e '
    let raw = "";
    process.stdin.setEncoding("utf8");
    process.stdin.on("data", (chunk) => (raw += chunk));
    process.stdin.on("end", () => {
      const data = JSON.parse(raw || "{}");
      for (const [name, meta] of Object.entries(data)) {
        const current = meta && meta.current ? meta.current : "";
        const wanted = meta && meta.wanted ? meta.wanted : "";
        const latest = meta && meta.latest ? meta.latest : "";
        console.log(`${name}\t${current}\t${wanted}\t${latest}`);
      }
    });
  ' | LC_ALL=C sort -u >"$tmp_outdated"

echo "== npm plan =="
echo "[to install]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[to update]"
awk -v FS='\t' 'NR==FNR { want[$1]=1; next } want[$1] { printf "  ~ %s (current=%s wanted=%s latest=%s)\n", $1, $2, $3, $4 }' \
  "$tmp_want" "$tmp_outdated"

echo "[to uninstall]"
comm -13 "$tmp_want" "$tmp_have" \
  | grep -v '^npm$' \
  | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have" "$tmp_outdated"
#+END_SRC

* Apply manifest inside DotCortex env
#+BEGIN_SRC bash :tangle all/.local/bin/npm-apply :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/npm-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.npm/manifest/global.ssv"
RUN="$HOME/DotCortex/all/.local/bin/dotcortex-node-env"

ENFORCE="${ENFORCE:-1}"   # 1 = enforce manifest membership, 0 = installs only
UNINSTALL="${UNINSTALL:-1}"
UPDATE="${UPDATE:-0}"     # 1 = allow upgrades, 0 = leave existing versions alone

echo "== npm apply =="

installed_count=0
updated_count=0
removed_count=0

# Normalize manifest rows to 8 pipe-separated fields, honoring "" as empty.
_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),
        dequote($5),dequote($6),dequote($7),dequote($8)
    }
  ' "$MAN"
}

# Build map of live package versions from npm list -g --depth=0 --json
declare -A live_ver
declare -A live_outdated

while IFS=$'\t' read -r name ver; do
  [ -n "${name:-}" ] || continue
  live_ver["$name"]="$ver"
done < <(
  "$RUN" npm list -g --depth=0 --json 2>/dev/null \
    | node -e '
        let raw = "";
        process.stdin.setEncoding("utf8");
        process.stdin.on("data", (chunk) => (raw += chunk));
        process.stdin.on("end", () => {
          const deps = JSON.parse(raw || "{}").dependencies || {};
          for (const name of Object.keys(deps)) {
            const version = deps[name] && deps[name].version ? deps[name].version : "";
            console.log(`${name}\t${version}`);
          }
        });
      ' | LC_ALL=C sort -u
)

# Build a set of outdated global packages. npm exits non-zero when updates exist,
# so capture stdout and ignore the status.
while IFS= read -r name; do
  [ -n "${name:-}" ] || continue
  live_outdated["$name"]=1
done < <(
  {
    "$RUN" npm outdated -g --json 2>/dev/null || true
  } | node -e '
      let raw = "";
      process.stdin.setEncoding("utf8");
      process.stdin.on("data", (chunk) => (raw += chunk));
      process.stdin.on("end", () => {
        const data = JSON.parse(raw || "{}");
        for (const name of Object.keys(data)) {
          console.log(name);
        }
      });
    ' | LC_ALL=C sort -u
)

declare -A want_names

# Apply manifest: install / upgrade as needed
while IFS='|' read -r pkg version flags global_flag source registry tarball extra
do
  [ -n "$pkg" ] || continue
  want_names["$pkg"]=1

  # npm itself is usually managed with Node, not via this loom
  if [ "$pkg" = "npm" ]; then
    continue
  fi

  installed_ver="${live_ver[$pkg]:-}"

  needs_install=0
  if [ -z "$installed_ver" ]; then
    needs_install=1
  elif [ "$UPDATE" = "1" ]; then
    if [ -n "$version" ] && [ "$version" != "$installed_ver" ]; then
      needs_install=1
    elif [ -z "$version" ] && [ -n "${live_outdated[$pkg]:-}" ]; then
      needs_install=1
    fi
  fi

  if [ "$needs_install" = "1" ]; then
    spec="$pkg"
    action="install"
    if [ -n "$version" ]; then
      spec="$pkg@$version"
      [ -n "$installed_ver" ] && action="update"
    elif [ -n "$installed_ver" ]; then
      action="update"
    fi

    args=(install -g "$spec")

    # Allow FLAGS column to carry extra npm args, comma-separated.
    if [ -n "$flags" ]; then
      IFS=',' read -ra FF <<<"$flags"
      for f in "${FF[@]}"; do
        [ -n "$f" ] && args+=("$f")
      done
    fi

    echo ">> npm $action -g $spec"
    "$RUN" npm "${args[@]}"
    if [ "$action" = "install" ]; then
      installed_count=$((installed_count + 1))
    else
      updated_count=$((updated_count + 1))
    fi
  fi

  DOTCORTEX_NODE_ENV="$RUN" bash "$HOME/DotCortex/all/.local/bin/npm-postapply" "$pkg" "$extra"
done < <(_emit_norm)

# Optional uninstall of extras
if [ "$ENFORCE" = "1" ] && [ "$UNINSTALL" = "1" ]; then
  echo "== uninstall extras =="

  # Sorted iteration for stable output; npm itself is skipped.
  for pkg in $(printf '%s\n' "${!live_ver[@]}" | sort); do
    [ "$pkg" = "npm" ] && continue
    if [ -z "${want_names[$pkg]:-}" ]; then
      echo ">> npm uninstall -g $pkg"
      "$RUN" npm uninstall -g "$pkg" || true
      removed_count=$((removed_count + 1))
    fi
  done
fi

if [ "$installed_count" = 0 ] && [ "$updated_count" = 0 ] && [ "$removed_count" = 0 ]; then
  echo "Already aligned: no npm installs, updates, or removals needed."
else
  echo "Summary: installed=$installed_count updated=$updated_count removed=$removed_count"
fi

echo "Done."
#+END_SRC

* Health
#+BEGIN_SRC bash :tangle all/.local/bin/npm-health :shebang "#!/usr/bin/env bash"
# ~/DotCortex/all/.local/bin/npm-health
set -euo pipefail

"$HOME/DotCortex/all/.local/bin/dotcortex-node-env" bash -c '
echo "NODE      = $(command -v node || echo missing)"
echo "NPM       = $(command -v npm || echo missing)"
echo "node ver  = $(node --version 2>/dev/null || echo n/a)"
echo "npm ver   = $(npm --version 2>/dev/null || echo n/a)"
echo "NPM_CONFIG_PREFIX=${NPM_CONFIG_PREFIX:-}"
echo "npm prefix= $(npm config get prefix 2>/dev/null || echo n/a)"
'
#+END_SRC

* Makefile fragment for npm
#+BEGIN_SRC makefile :tangle all/.mk/npm.mk :padline no
# ~/DotCortex/all/.mk/npm.mk
.RECIPEPREFIX := |
SHELL := /bin/bash

.PHONY: npm-capture npm-diff npm-sync npm-apply npm-health

npm-capture:
| @chmod +x $(HOME)/.local/bin/npm-capture 2>/dev/null || true
| $(HOME)/.local/bin/npm-capture

npm-diff:
| @chmod +x $(HOME)/.local/bin/npm-diff 2>/dev/null || true
| $(HOME)/.local/bin/npm-diff

# Install missing packages and update tracked packages, but do not uninstall extras.
npm-sync:
| @chmod +x $(HOME)/.local/bin/npm-apply 2>/dev/null || true
| ENFORCE=0 UNINSTALL=0 UPDATE=1 $(HOME)/.local/bin/npm-apply

# Strict apply, install/update tracked packages, and enforce manifest membership.
npm-apply:
| @chmod +x $(HOME)/.local/bin/npm-apply 2>/dev/null || true
| ENFORCE=1 UNINSTALL=1 UPDATE=1 $(HOME)/.local/bin/npm-apply

npm-health:
| @chmod +x $(HOME)/.local/bin/npm-health 2>/dev/null || true
| $(HOME)/.local/bin/npm-health
#+END_SRC
