all/.local/bin/dotcortex-node-env
#!/usr/bin/env bash
# Isolated Node env for DotCortex

# [[file:../../../npm.org::*Isolated Node env for DotCortex][Isolated Node env for DotCortex:1]]
# ~/DotCortex/all/.local/bin/dotcortex-node-env
#!/usr/bin/env bash
set -euo pipefail

export NPM_CONFIG_PREFIX="${NPM_CONFIG_PREFIX:-$HOME/.npm-global}"
export PATH="$HOME/.local/bin:$HOME/.cargo/bin:/usr/local/bin:/usr/local/sbin:$PATH"

if [ -d "$HOME/.config/guix/current/bin" ]; then
  export PATH="$HOME/.config/guix/current/bin:$PATH"
fi

# Prefer DotCortex-managed Guix Node/NPM over the host system toolchain.
if [ -d "$HOME/.guix-extra-profiles/core/core/bin" ]; then
  export PATH="$HOME/.guix-extra-profiles/core/core/bin:$PATH"
fi

if [ -d "$HOME/.guix-extra-profiles/core/core/lib/locale" ]; then
  export GUIX_LOCPATH="${GUIX_LOCPATH:-$HOME/.guix-extra-profiles/core/core/lib/locale}"
fi

# Ensure the prefix directories exist for npm
if [ ! -d "$NPM_CONFIG_PREFIX/lib/node_modules" ]; then
  mkdir -p "$NPM_CONFIG_PREFIX/lib/node_modules"
fi

if [ ! -d "$NPM_CONFIG_PREFIX/bin" ]; then
  mkdir -p "$NPM_CONFIG_PREFIX/bin"
fi

export PATH="$NPM_CONFIG_PREFIX/bin:$PATH"

unset LD_LIBRARY_PATH 2>/dev/null || true

exec "$@"
# Isolated Node env for DotCortex:1 ends here
