all/.local/bin/npm-apply
#!/usr/bin/env bash
# Apply manifest inside DotCortex env

# [[file:../../../npm.org::*Apply manifest inside DotCortex env][Apply manifest inside DotCortex env:1]]
# ~/DotCortex/all/.local/bin/npm-apply
set -euo pipefail

MAN="$HOME/DotCortex/all/.npm/manifest/global.ssv"
RUN="$HOME/DotCortex/all/.local/bin/dotcortex-node-env"

ENFORCE="${ENFORCE:-1}"   # 1 = enforce manifest membership, 0 = installs only
UNINSTALL="${UNINSTALL:-1}"
UPDATE="${UPDATE:-0}"     # 1 = allow upgrades, 0 = leave existing versions alone

echo "== npm apply =="

installed_count=0
updated_count=0
removed_count=0

# Normalize manifest rows to 8 pipe-separated fields, honoring "" as empty.
_emit_norm() {
  awk -v FS='[ \t]+' '
    function dequote(s){ return (s=="\"\"" ? "" : s) }
    $0 ~ /^[ \t]*#/ || NF==0 { next }
    {
      printf "%s|%s|%s|%s|%s|%s|%s|%s\n",
        dequote($1),dequote($2),dequote($3),dequote($4),
        dequote($5),dequote($6),dequote($7),dequote($8)
    }
  ' "$MAN"
}

# Build map of live package versions from npm list -g --depth=0 --json
declare -A live_ver
declare -A live_outdated

while IFS=$'\t' read -r name ver; do
  [ -n "${name:-}" ] || continue
  live_ver["$name"]="$ver"
done < <(
  "$RUN" npm list -g --depth=0 --json 2>/dev/null \
    | node -e '
        let raw = "";
        process.stdin.setEncoding("utf8");
        process.stdin.on("data", (chunk) => (raw += chunk));
        process.stdin.on("end", () => {
          const deps = JSON.parse(raw || "{}").dependencies || {};
          for (const name of Object.keys(deps)) {
            const version = deps[name] && deps[name].version ? deps[name].version : "";
            console.log(`${name}\t${version}`);
          }
        });
      ' | LC_ALL=C sort -u
)

# Build a set of outdated global packages. npm exits non-zero when updates exist,
# so capture stdout and ignore the status.
while IFS= read -r name; do
  [ -n "${name:-}" ] || continue
  live_outdated["$name"]=1
done < <(
  {
    "$RUN" npm outdated -g --json 2>/dev/null || true
  } | node -e '
      let raw = "";
      process.stdin.setEncoding("utf8");
      process.stdin.on("data", (chunk) => (raw += chunk));
      process.stdin.on("end", () => {
        const data = JSON.parse(raw || "{}");
        for (const name of Object.keys(data)) {
          console.log(name);
        }
      });
    ' | LC_ALL=C sort -u
)

declare -A want_names

# Apply manifest: install / upgrade as needed
while IFS='|' read -r pkg version flags global_flag source registry tarball extra
do
  [ -n "$pkg" ] || continue
  want_names["$pkg"]=1

  # npm itself is usually managed with Node, not via this loom
  if [ "$pkg" = "npm" ]; then
    continue
  fi

  installed_ver="${live_ver[$pkg]:-}"

  needs_install=0
  if [ -z "$installed_ver" ]; then
    needs_install=1
  elif [ "$UPDATE" = "1" ]; then
    if [ -n "$version" ] && [ "$version" != "$installed_ver" ]; then
      needs_install=1
    elif [ -z "$version" ] && [ -n "${live_outdated[$pkg]:-}" ]; then
      needs_install=1
    fi
  fi

  if [ "$needs_install" = "1" ]; then
    spec="$pkg"
    action="install"
    if [ -n "$version" ]; then
      spec="$pkg@$version"
      [ -n "$installed_ver" ] && action="update"
    elif [ -n "$installed_ver" ]; then
      action="update"
    fi

    args=(install -g "$spec")

    # Allow FLAGS column to carry extra npm args, comma-separated.
    if [ -n "$flags" ]; then
      IFS=',' read -ra FF <<<"$flags"
      for f in "${FF[@]}"; do
        [ -n "$f" ] && args+=("$f")
      done
    fi

    echo ">> npm $action -g $spec"
    "$RUN" npm "${args[@]}"
    if [ "$action" = "install" ]; then
      installed_count=$((installed_count + 1))
    else
      updated_count=$((updated_count + 1))
    fi
  fi

  DOTCORTEX_NODE_ENV="$RUN" bash "$HOME/DotCortex/all/.local/bin/npm-postapply" "$pkg" "$extra"
done < <(_emit_norm)

# Optional uninstall of extras
if [ "$ENFORCE" = "1" ] && [ "$UNINSTALL" = "1" ]; then
  echo "== uninstall extras =="

  # Sorted iteration for stable output; npm itself is skipped.
  for pkg in $(printf '%s\n' "${!live_ver[@]}" | sort); do
    [ "$pkg" = "npm" ] && continue
    if [ -z "${want_names[$pkg]:-}" ]; then
      echo ">> npm uninstall -g $pkg"
      "$RUN" npm uninstall -g "$pkg" || true
      removed_count=$((removed_count + 1))
    fi
  done
fi

if [ "$installed_count" = 0 ] && [ "$updated_count" = 0 ] && [ "$removed_count" = 0 ]; then
  echo "Already aligned: no npm installs, updates, or removals needed."
else
  echo "Summary: installed=$installed_count updated=$updated_count removed=$removed_count"
fi

echo "Done."
# Apply manifest inside DotCortex env:1 ends here
