all/.local/bin/npm-capture
#!/usr/bin/env bash
# Capture current global npm → manifest
# # Append any new global npm packages into DotCortex manifest, do not clobber.

# [[file:../../../npm.org::*Capture current global npm → manifest][Capture current global npm → manifest:1]]
# ~/DotCortex/all/.local/bin/npm-capture
set -euo pipefail

MAN="$HOME/DotCortex/all/.npm/manifest/global.ssv"
RUN="$HOME/DotCortex/all/.local/bin/dotcortex-node-env"

mkdir -p "$(dirname "$MAN")"
touch "$MAN"

tmp_existing="$(mktemp)"
tmp_have="$(mktemp)"
tmp_new="$(mktemp)"

# Existing packages already tracked in manifest
awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | LC_ALL=C sort -u >"$tmp_existing"

# Current global packages (names only) from npm list -g --depth=0 --json
"$RUN" npm list -g --depth=0 --json 2>/dev/null \
  | node -e '
      let raw = "";
      process.stdin.setEncoding("utf8");
      process.stdin.on("data", (chunk) => (raw += chunk));
      process.stdin.on("end", () => {
        const deps = JSON.parse(raw || "{}").dependencies || {};
        for (const name of Object.keys(deps)) {
          console.log(name);
        }
      });
    ' | LC_ALL=C sort -u >"$tmp_have"

# new = have - existing
comm -13 "$tmp_existing" "$tmp_have" >"$tmp_new"

rm -f "$tmp_existing" "$tmp_have"

if [ ! -s "$tmp_new" ]; then
  rm -f "$tmp_new"
  echo "No new npm globals to capture into $MAN"
  exit 0
fi

while read -r pkg; do
  [ -n "$pkg" ] || continue
  [ "$pkg" = "npm" ] && continue
  # PKG VERSION FLAGS GLOBAL SOURCE REGISTRY TARBALL EXTRA
  printf '%s "" "" "global" "registry" "" "" ""\n' "$pkg" >>"$MAN"
done <"$tmp_new"

rm -f "$tmp_new"

echo "Updated $MAN"
# Capture current global npm → manifest:1 ends here
