all/.local/bin/npm-diff
#!/usr/bin/env bash
# Plan diff

# [[file:../../../npm.org::*Plan diff][Plan diff:1]]
# ~/DotCortex/all/.local/bin/npm-diff
set -euo pipefail

MAN="$HOME/DotCortex/all/.npm/manifest/global.ssv"
RUN="$HOME/DotCortex/all/.local/bin/dotcortex-node-env"

tmp_want="$(mktemp)"
tmp_have="$(mktemp)"
tmp_outdated="$(mktemp)"

# Desired packages from manifest
awk '!/^[[:space:]]*#/ && NF { print $1 }' "$MAN" | LC_ALL=C sort -u >"$tmp_want"

# Live global packages from npm
"$RUN" npm list -g --depth=0 --json 2>/dev/null \
  | node -e '
      let raw = "";
      process.stdin.setEncoding("utf8");
      process.stdin.on("data", (chunk) => (raw += chunk));
      process.stdin.on("end", () => {
        const deps = JSON.parse(raw || "{}").dependencies || {};
        for (const name of Object.keys(deps)) {
          console.log(name);
        }
      });
    ' | LC_ALL=C sort -u >"$tmp_have"

# Live outdated packages from npm. npm exits non-zero when updates exist.
{
  "$RUN" npm outdated -g --json 2>/dev/null || true
} | node -e '
    let raw = "";
    process.stdin.setEncoding("utf8");
    process.stdin.on("data", (chunk) => (raw += chunk));
    process.stdin.on("end", () => {
      const data = JSON.parse(raw || "{}");
      for (const [name, meta] of Object.entries(data)) {
        const current = meta && meta.current ? meta.current : "";
        const wanted = meta && meta.wanted ? meta.wanted : "";
        const latest = meta && meta.latest ? meta.latest : "";
        console.log(`${name}\t${current}\t${wanted}\t${latest}`);
      }
    });
  ' | LC_ALL=C sort -u >"$tmp_outdated"

echo "== npm plan =="
echo "[to install]"
comm -23 "$tmp_want" "$tmp_have" | sed 's/^/  + /'

echo "[to update]"
awk -v FS='\t' 'NR==FNR { want[$1]=1; next } want[$1] { printf "  ~ %s (current=%s wanted=%s latest=%s)\n", $1, $2, $3, $4 }' \
  "$tmp_want" "$tmp_outdated"

echo "[to uninstall]"
comm -13 "$tmp_want" "$tmp_have" \
  | grep -v '^npm$' \
  | sed 's/^/  - /'

rm -f "$tmp_want" "$tmp_have" "$tmp_outdated"
# Plan diff:1 ends here
