all/.local/bin/npm-postapply
#!/usr/bin/env bash
# Package-specific npm post-apply hooks

# [[file:../../../npm.org::*Package-specific npm post-apply hooks][Package-specific npm post-apply hooks:1]]
# ~/DotCortex/all/.local/bin/npm-postapply
set -euo pipefail

pkg="${1:?package name required}"
extra="${2:-}"
RUN="${DOTCORTEX_NODE_ENV:-$HOME/DotCortex/all/.local/bin/dotcortex-node-env}"

export NPM_CONFIG_PREFIX="${NPM_CONFIG_PREFIX:-$HOME/.npm-global}"

pkg_dir="$NPM_CONFIG_PREFIX/lib/node_modules/$pkg"

write_cloudcli_env() {
  mkdir -p "$pkg_dir"
  cat >"$pkg_dir/.env" <<EOF
# Managed by DotCortex via npm.org
SERVER_PORT=3001
HOST=0.0.0.0
VITE_PORT=5173
DATABASE_PATH=$HOME/.cloudcli/auth.db
CLAUDE_CLI_PATH=claude
CONTEXT_WINDOW=160000
WORKSPACES_ROOT=$HOME
EOF
}

cloudcli_binary_healthy() {
  [ -d "$pkg_dir" ] || return 1

  "$RUN" node - "$pkg_dir" <<'EOF'
const path = require('path');

const pkgDir = process.argv[2];

try {
  require(path.join(pkgDir, 'node_modules', 'better-sqlite3'));
  process.exit(0);
} catch (error) {
  process.stderr.write(String(error && error.message ? error.message : error) + '\n');
  process.exit(1);
}
EOF
}

ensure_cloudcli_setup() {
  [ -d "$pkg_dir" ] || return 0

  write_cloudcli_env

  if ! cloudcli_binary_healthy; then
    echo "== npm postapply: rebuilding native modules for $pkg =="
    "$RUN" npm rebuild -g "$pkg" better-sqlite3

    if ! cloudcli_binary_healthy; then
      echo "CloudCLI native module check still failed after rebuild" >&2
      return 1
    fi
  fi
}

case "$extra" in
  cloudcli-setup)
    ensure_cloudcli_setup
    ;;
esac
# Package-specific npm post-apply hooks:1 ends here
